<template>
  <h2>
    Основные различия между HTTP (Hypertext Transfer Protocol) и HTTPS (HTTP
    Secure)
  </h2>
  <ul>
    <li>
      <p>
        HTTPS использует шифрование SSL/TLS для обеспечения безопасности
        передаваемых данных, в то время как HTTP передает данные в открытом
        виде.
      </p>
    </li>
    <li><p>HTTPS использует порт 443, а HTTP - порт 80.</p></li>
    <li>
      <p>
        HTTPS требует наличия сертификата SSL/TLS для проверки подлинности
        сервера, в то время как HTTP не требует такой проверки.
      </p>
    </li>
  </ul>
  <p><strong>Cookie</strong></p>
  <p>
    Это небольшой фрагмент данных, который веб-сервер отправляет веб-браузеру, а
    затем браузер возвращает его в каждом последующем запросе к серверу. Они
    используются в HTTP для хранения информации о состоянии сеанса, такой как
    данные аутентификации или предпочтения пользователя.
  </p>
</template>

<script>
export default {};
</script>
