<template>
  <h2>
    Основные меры безопасности при работе с HTTP
  </h2>
  <ul>
    <li><p>Использование HTTPS для защиты передаваемых данных.</p></li>
    <li><p>Ограничение доступа к конфиденциальной информации.</p></li>
    <li>
      <p>Применение проверки подлинности и авторизации для контроля доступа.</p>
    </li>
    <li>
      <p>
        Защита от атак, таких как межсайтовый скриптинг (XSS) и подделка
        запросов между сайтами (CSRF).
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
