<template>
  <h2>Что такое WevSockets</h2>
  <p>
    Веб-сокеты (websockets) - это технология, позволяющая устанавливать
    постоянное двухстороннее соединение между клиентом и сервером через протокол
    WebSocket. В отличие от HTTP, веб-сокеты позволяют серверу отправлять данные
    клиенту в режиме реального времени без необходимости постоянных запросов от
    клиента. Веб-сокеты работают на основе событий - клиент и сервер могут
    отправлять и принимать сообщения друг от друга, что делает их полезными для
    реализации чата, игр, обновления данных в реальном времени и других
    приложений, требующих постоянного обмена информацией.
  </p>
</template>

<script>
export default {};
</script>
