<template>
  <h2>
    Какие основные различия между HTTP и WebSockets?
  </h2>
  <ul>
    <li>
      <p>
        HTTP является протоколом запрос-ответ, в то время как WebSockets
        позволяют би-дирекциональную связь между клиентом и сервером.
      </p>
    </li>
    <li>
      <p>
        HTTP использует схему &quot;один запрос - один ответ&quot;, в то время
        как WebSockets поддерживают постоянное соединение, позволяя обмен
        данными без необходимости повторных запросов.
      </p>
    </li>
    <li>
      <p>
        HTTP не поддерживает пуш-уведомления от сервера, в то время как
        WebSockets позволяют серверу активно отправлять данные клиенту.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
