<template>
<h2>Какие способы авторизации вы знаете в HTTP</h2>
<ul>
<li><p>Basic авторизация: Клиент отправляет логин и пароль в зашифрованном
виде в заголовке Authorization. Этот метод не является безопасным,
поскольку данные передаются в открытом виде, и рекомендуется
использовать его только при использовании HTTPS.</p>
</li>
<li><p>Bearer авторизация: Клиент получает токен доступа (токен
авторизации) после успешной аутентификации, обычно через механизмы,
такие как OAuth или OpenID Connect. Затем клиент отправляет этот
токен в заголовке Authorization с префиксом &quot;Bearer&quot;. Сервер
проверяет токен для авторизации запроса.</p>
</li>
<li><p>Digest авторизация: Похожа на Basic авторизацию, но пароль не
передается в открытом виде. Вместо этого клиент отправляет хеш
пароля, используя некоторые хэш-функции, такие как MD5 или SHA. Этот
метод обеспечивает некоторую степень безопасности, но все же не
рекомендуется его использовать без HTTPS.</p>
</li>
<li><p>OAuth авторизация: OAuth (Open Authorization) - протокол
авторизации, который позволяет клиентским приложениям запрашивать
доступ к защищенным ресурсам от имени пользователя. Этот метод
широко используется в многочисленных API социальных сетей и других
онлайн-сервисов.</p>
</li>
</ul>
<p>Каждый из этих методов имеет свои особенности и используется в различных
сценариях в зависимости от требований проекта.</p>

</template>

<script>
export default {};
</script>
