<template>
  <h2>Какие методы HTTP вы знаете</h2>

  Некоторые из наиболее распространенных методов HTTP:
  <ul>
    <li>
      GET: запрос используется для получения данных с сервера. Он отправляет
      запрос на сервер с указанием ресурса, который требуется получить.
      GET-запросы могут содержать параметры в URL для передачи дополнительной
      информации. Ответ на GET-запрос обычно содержит запрошенные данные.
    </li>
    <li>
      POST: запрос используется для отправки данных на сервер для обработки. Он
      отправляет запрос на сервер с данными, которые нужно передать.
      POST-запросы могут содержать тело запроса, в котором передаются данные.
      Ответ на POST-запрос может содержать результаты обработки данных на
      сервере.
    </li>
    <li>
      PUT: это HTTP метод, который используется для обновления или замены
      ресурса на сервере. При отправке PUT запроса клиент указывает URL целевого
      ресурса и в теле запроса передает новые данные, которые должны заменить
      существующий ресурс. Если ресурс не существует, сервер может создать его.
      PUT запросы являются идемпотентными, что означает, что повторный запрос с
      теми же данными не должен привести к нежелательным изменениям.
    </li>
    <li>
      DELETE: это HTTP метод, который используется для удаления ресурса на
      сервере. При отправке DELETE запроса клиент указывает URL целевого
      ресурса, который нужно удалить. Сервер обрабатывает запрос и удаляет
      указанный ресурс. DELETE запросы также являются идемпотентными, поскольку
      повторное выполнение запроса не должно привести к ошибкам или
      нежелательным побочным эффектам.
    </li>
    <li>
      PATCH: это HTTP метод, который используется для частичного обновления
      ресурса на сервере. В отличие от PUT запроса, который полностью заменяет
      ресурс, PATCH запрос позволяет клиенту передавать только измененные части
      ресурса. Таким образом, клиент может отправить только необходимые
      изменения, минимизируя объем данных, передаваемых в запросе. PATCH запросы
      полезны при работе с большими или сложными ресурсами, когда полное
      обновление нецелесообразно или нежелательно.
    </li>
    <li>
      HEAD: это HTTP метод, который выполняет аналогичные GET запросу операции,
      но без тела ответа. При отправке HEAD запроса сервер возвращает только
      заголовки ответа, без фактического содержимого ресурса. HEAD запросы
      полезны, когда клиенту необходимо получить метаданные о ресурсе, такие как
      размер файла или дата последнего изменения, без передачи всего
      содержимого.
    </li>
    <li>
      OPTION: это HTTP метод, который используется для получения информации о
      возможностях сервера или параметрах конкретного ресурса. Когда клиент
      отправляет OPTIONS запрос, сервер возвращает заголовки с информацией о
      поддерживаемых методах, разрешенных заголовках, поддержке CORS
      (Cross-Origin Resource Sharing) и других метаданных. OPTIONS запросы
      полезны при разработке API или при проверке доступности и конфигурации
      сервера.
    </li>
    <li>
      CONNECT - в HTTP используется для установки \"туннеля\" между клиентом и
      сервером через прокси-сервер. Он позволяет клиенту установить защищенное
      SSL/TLS соединение с сервером, обходя прокси-серверы, которые могут
      блокировать такие соединения.
    </li>
  </ul>
</template>

<script>
export default {};
</script>
