<template>
<h2>Что такое перенаправление в HTTP и как оно работает</h2>
<p>Перенаправление в HTTP - это процесс, при котором сервер отправляет
клиенту специальный HTTP-ответ, указывающий на необходимость
перенаправления на другой URL-адрес. Это может происходить по разным
причинам, например, когда запрашиваемый ресурс переехал на другой адрес
или требуется аутентификация.</p>
<p>Когда клиент получает ответ с кодом перенаправления (например, 301 Moved
Permanently или 302 Found), он перенаправляет запрос на новый URL,
указанный в заголовке ответа. Клиент повторно отправляет запрос на новый
URL, чтобы получить требуемый ресурс.</p>

</template>

<script>
export default {};
</script>
