<template>
<h2>Что такое сессионные куки и персистентные куки в HTTP</h2>
<p>Сессионные куки и персистентные куки - это два типа куки в HTTP:</p>
<ul>
<li><p>Сессионные куки: Сессионные куки хранятся только до закрытия сессии
браузера. Они не имеют установленного срока действия и удаляются
после закрытия браузера. Сессионные куки обычно используются для
хранения временных данных, таких как информация о входе в систему
или состоянии сеанса.</p>
</li>
<li><p>Персистентные куки: Персистентные куки имеют установленный срок
действия и сохраняются на компьютере пользователя после закрытия
браузера. Они используются для хранения долгосрочных данных, таких
как предпочтения пользователя или идентификационные данные.
Персистентные куки могут быть удалены только по истечении их срока
действия или при удалении пользователем.</p>
</li>
</ul>

</template>

<script>
export default {};
</script>
