<template>
<h2>Что такое XSS-атака</h2>
<p>XSS-атака (Cross-Site Scripting) - это тип атаки на веб-приложения, при
которой злоумышленник внедряет вредоносный JavaScript код в веб-страницы
или приложения, которые просматривают другие пользователи. Когда
пользователь взаимодействует с зараженной страницей, вредоносный код
выполняется в его браузере, что позволяет злоумышленнику получать доступ
к личным данным, изменять содержимое страницы или выполнять другие
вредоносные действия от имени пользователя. XSS-атаки могут быть
классифицированы как хранимые (stored), отраженные (reflected) и
DOM-based, в зависимости от способа внедрения и выполнения вредоносного
кода. Для защиты от XSS-атак следует применять соответствующие методы,
такие как фильтрация и кодирование входных данных, использование Content
Security Policy (CSP) и тщательное тестирование приложений на
уязвимости.</p>

</template>

<script>
export default {};
</script>
