<template>
  <h2>Что такое CSRF-атака</h2>
  <p>
    CSRF-атака (Cross-Site Request Forgery) - это тип атаки на веб-приложения,
    при которой злоумышленник заставляет авторизованного пользователя выполнять
    нежелательные действия на веб-сайте без его согласия. Атакующий создает
    поддельные запросы, которые автоматически отправляются на целевой веб-сервер
    с использованием учетных данных пользователя. Если жертва посещает
    злоумышленный сайт или кликает на поддельную ссылку, ее браузер выполнит
    поддельный запрос, и веб-сервер будет рассматривать его как действие,
    совершенное от имени авторизованного пользователя. Чтобы защититься от
    CSRF-атак, рекомендуется использовать механизмы, такие как добавление токена
    CSRF к каждому запросу, проверка Referer заголовка и применение правильных
    заголовков безопасности.
  </p>
</template>

<script>
export default {};
</script>
