<template>
  <h2>Из чего состоит HTTP запрос</h2>
  <ul>
    <li>
      Метод запроса (Request Method): Определяет тип операции, которую клиент
      хочет выполнить на сервере. Некоторые распространенные методы запроса
      включают GET, POST, PUT, DELETE и HEAD.
    </li>
    <li>
      Заголовки (Headers): Представляют собой метаданные, которые передаются
      вместе с запросом и содержат дополнительную информацию о запросе, такую
      как тип содержимого, аутентификация, кеширование и другие параметры.
    </li>
    <li>
      Тело запроса (Request Body): Используется только в некоторых методах
      запроса, таких как POST или PUT. Оно содержит данные, которые клиент
      отправляет на сервер, например, форму для отправки или JSON-объект.
    </li>
  </ul>

</template>

<script>
export default {};
</script>
