<template>
  <h2>
    Какие наиболее распространенные HTTP-заголовки вы использовали в своей
    работе?
  </h2>
  <p>
    В моей работе я использовал следующие наиболее распространенные
    HTTP-заголовки:
  </p>
  <ul>
    <li><p>Content-Type: указывает тип содержимого передаваемых данных.</p></li>
    <li><p>Authorization: используется для аутентификации пользователя.</p></li>
    <li>
      <p>
        User-Agent: содержит информацию о клиенте, который отправляет запрос.
      </p>
    </li>
    <li>
      <p>
        Cache-Control: определяет, какие инструкции по кэшированию должны
        применяться.
      </p>
    </li>
    <li>
      <p>Accept: указывает типы содержимого, которые клиент может принять.</p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
