<template>
  <h2>Что такое селектор</h2>
  <p>Селектор в CSS - это паттерн, который используется для выбора и стилизации определенных элементов на веб-странице.</p>
  <p>Примеры селекторов:</p>
  <ul>
      <li>
         <p>Селектор по типу элемента:</p>
         <ul>
            <li>h1 - выбирает все элементы {{'<h1>'}}.</li>
            <li>p - выбирает все элементы {{'<p>'}}.</li>
         </ul>
      </li>
      <li>
         <p>Селектор по идентификатору:</p>
         <ul>
            <li>#myElement - выбирает элемент с идентификатором myElement.</li>
         </ul>
      </li>
      <li>
         <p>Селектор по классу:</p>
         <ul><li>.myClass - выбирает все элементы с классом myClass.</li></ul>
      </li>
      <li>
         <p>Селектор потомка:</p>
         <ul><li>.parent .child - выбирает все элементы с классом child, которые являются потомками элемента с классом parent.</li></ul>
      </li>
      <li>
         <p>Селектор псевдокласса:</p>
         <ul><li>a:hover - выбирает ссылки, когда они находятся в состоянии наведения.</li></ul>
      </li>
      <li>
         <p>Селектор атрибута:</p>
         <ul><li>
   [type="text"] - выбирает элементы с атрибутом type и значением text.</li></ul>
      </li>
  </ul>
  <p>Это лишь некоторые примеры селекторов, существует много различных селекторов в CSS, которые позволяют более точно выбирать элементы для стилизации.</p>
</template>

<script>
export default {};
</script>



