<template>
  <h2>Какие виды позиционирования знаете</h2>
  <p>В CSS существуют несколько основных видов позиционирования элементов:</p>
  <ul>
    <li>
      <p>
        Static --  Статическое позиционирование: Это значение по умолчанию для всех
        элементов. Элементы с статическим позиционированием располагаются в
        порядке их появления в документе.
      </p>
    </li>
    <li>
      <p>
        Relative -- Относительное позиционирование: Элемент с относительным
        позиционированием остается в потоке документа, но может быть смещен
        относительно своего исходного положения с использованием свойств top,
        right, bottom и left.
      </p>
    </li>
    <li>
      <p>
        Absolute -- Абсолютное позиционирование: Элемент с абсолютным
        позиционированием полностью вырывается из потока документа и
        позиционируется относительно его ближайшего родительского элемента с
        нестатическим позиционированием или относительно самого окна браузера.
        Элементы с абсолютным позиционированием могут быть смещены с помощью
        свойств top, right, bottom и left.
      </p>
    </li>
    <li>
      <p>
        Fixed -- Фиксированное позиционирование: Элемент с фиксированным
        позиционированием также вырывается из потока документа и позиционируется
        относительно окна браузера. Он остается на фиксированной позиции, даже
        при прокрутке страницы. Элементы с фиксированным позиционированием также
        могут быть смещены с помощью свойств top, right, bottom и left.
      </p>
    </li>
    <li>
      <p>
        Sticky -- Липкое позиционирование: Элемент с
        позиционированием sticky остается в потоке документа, пока не достигнет
        определенной точки на экране, а затем "прилипает" к этой точке и ведет
        себя как элемент с фиксированным позиционированием.
        Применение sticky может быть полезным, когда необходимо закрепить
        элемент в определенном месте на странице, чтобы он оставался видимым при
        прокрутке содержимого. Например, шапка сайта может быть закреплена
        вверху страницы при прокрутке, чтобы пользователь всегда имел доступ к
        навигационным элементам.
      </p>
    </li>
  </ul>
  <p>
    Каждый из этих видов позиционирования имеет свои особенности и применяется в
    зависимости от требований макета и поведения элементов на странице.
  </p>
</template>

<script>
export default {};
</script>
