<template>
  <h2>Что такое специфичность в CSS</h2>
  <p>
    Специфичность в CSS определяет, какой стиль будет применен к элементу, когда
    есть несколько правил, которые могут быть применены к нему. Это позволяет
    браузеру определить, какое правило имеет больший приоритет и должно быть
    применено.
  </p>
  <p>
    Приоритет такой: инлайн стили, селектор ид, селектор класса, селектор тега.
  </p>
  <p>
    Если два правила имеют одинаковую специфичность, то последнее правило в
    таблице стилей будет применено.
  </p>
</template>

<script>
export default {};
</script>
