<template>
  <h2>Что такое встроенные компоненты (built-in components) в Vue.js</h2>
  <p>
    Приведите примеры. Встроенные компоненты в Vue.js - это набор
    предопределенных компонентов, предоставляемых фреймворком. Они представляют
    собой готовые к использованию компоненты, такие как transition,
    transition-group, component, keep-alive и другие. Эти компоненты облегчают
    реализацию определенного функционала, такого как анимации, динамические
    компоненты и кэширование.
  </p>
</template>

<script>
export default {};
</script>
