<template>
  <h2>Как в Vue.js можно работать с анимациями</h2>
  <p>
    В Vue.js для работы с анимациями можно использовать встроенные директивы
    v-enter, v-leave и их модификаторы, а также переходы (transitions) и
    анимации (animations). При добавлении или удалении элементов из DOM, Vue.js
    автоматически применяет соответствующие классы и запускает анимации, если
    они определены. Это позволяет создавать плавные переходы и анимации в
    приложении.
  </p>
</template>

<script>
export default {};
</script>
