<template>
  <h2>Жизненный цикл в VUE</h2>
  <p>
    В Vue.js компоненты имеют жизненный цикл, который состоит из различных хуков
    (hooks). Хуки позволяют выполнять код на разных этапах жизненного цикла
    компонента, например, при создании, обновлении или удалении. Некоторые из
    наиболее часто используемых хуков: `created`, `mounted`, `updated`,
    `destroyed`.
  </p>
  <p>
    С помощью этих хуков можно выполнять дополнительные действия, такие как
    загрузка данных, обновление стилей или подключение к сторонним библиотекам.
  </p>
</template>

<script>
export default {};
</script>
