<template>
  <h2>Компоненты высшего порядка в VUE</h2>
  <p>
    В Vue.js компоненты высшего порядка (higher order components) являются
    функциями, которые принимают компонент и возвращают новый компонент с
    расширенным функционалом. Это позволяет повторно использовать логику и
    функциональность между разными компонентами. Компоненты высшего порядка
    могут использоваться, например, для добавления общей логики для обработки
    данных или аутентификации.
  </p>
</template>

<script>
export default {};
</script>
