<template>
  <h2>Декораторы в VUE</h2>
  <p>
    Декораторы в Vue.js - это экспериментальная функциональность, которая
    позволяет использовать синтаксический сахар для добавления дополнительной
    функциональности к компонентам. Декораторы могут использоваться для
    добавления миксинов, директив, фильтров и других возможностей к компонентам.
    Они используются с помощью специальных аннотаций (`@`) перед определением
    компонента.
  </p>
</template>

<script>
export default {};
</script>
