<template>
  <h2>Какие методы жизненного цикла компонента в Vue.js вы знаете</h2>
  <p>
    В Vue.js есть несколько методов жизненного цикла компонента, которые
    позволяют выполнять определенные действия на разных этапах жизненного цикла
    компонента. Некоторые из них включают created, mounted, updated, destroyed и
    другие. Эти методы позволяют разработчикам выполнить код на определенных
    этапах жизненного цикла компонента, например, для инициализации данных,
    выполнения запросов к API или очистки ресурсов.
  </p>
</template>

<script>
export default {};
</script>
