<template>
  <h2>Что такое Vue роутер и как им пользоваться</h2>
  <p>
    Vue роутер - это официальная библиотека маршрутизации для Vue.js. Он
    позволяет создавать одностраничные приложения с множеством маршрутов. Чтобы
    использовать Vue роутер, вы должны установить его через NPM, затем
    определить маршруты и связанные с ними компоненты. Вы можете использовать
    директиву router-link для навигации по маршрутам и компонент router-view для
    отображения соответствующего компонента, основываясь на текущем маршруте.
  </p>
</template>

<script>
export default {};
</script>
