<template>
  <h2>Как передать данные между компонентами в Vue.js</h2>
  <p>
    В Vue.js данные между компонентами можно передавать с помощью props, событий
    и системы шины событий (event bus). Props позволяют передавать данные от
    родительского компонента к дочернему, события позволяют родительскому
    компоненту реагировать на действия дочернего компонента, а шина событий
    позволяет передавать данные между компонентами, не связанными отношением
    родитель-ребенок.
  </p>
</template>

<script>
export default {};
</script>
