<template>
  <h2>Что такое абсолютные и относительные пути</h2>
  <p>
    Абсолютные и относительные пути используются для указания местоположения
    файлов или ресурсов на веб-сайте. Абсолютный путь указывает полный путь к
    файлу или ресурсу, начиная с корневого каталога.
  </p>
  <p>
    Относительный путь указывает путь относительно текущего расположения файла
    или ресурса.
  </p>
  <p>
    Разница между ними заключается в том, что абсолютный путь всегда указывает
    на одно и то же местоположение, независимо от текущего контекста, а
    относительный путь зависит от текущего контекста и может указывать на разные
    местоположения в разных ситуациях.
  </p>
</template>

<script>
export default {};
</script>
