<template>
<h2>Что такое семантика и семантичные элементы</h2>
<p>Семантика в веб-разработке относится к использованию HTML-элементов для
ясного и понятного описания содержимого веб-страницы.</p>
<p>Семантичные элементы - это HTML-теги, которые имеют смысл и описывают
свое содержимое. Они предоставляют информацию о структуре и значении
содержимого страницы, что полезно для поисковых систем, доступности и
понимания кода другими разработчиками.</p>
<p>Некоторые примеры семантичных элементов в HTML5 включают {{ `<header>,
<nav>, <section>, <article>, <footer>` }} </p>
<p>Я использую семантические элементы для улучшения структуры и смысла моих
веб-страниц.</p>

</template>

<script>
export default {};
</script>
