<template>
  <h2>Что такое метатеги и зачем нужны</h2>
  <p>
    Метатеги - это элементы HTML, которые предоставляют информацию о
    веб-странице. Они содержат метаданные, которые не отображаются на странице,
    но используются браузерами и поисковыми системами.
  </p>
  <p>
    Метатеги могут содержать информацию о кодировке страницы, описании страницы,
    ключевых словах, авторе и других метаданных. Они также могут определять
    поведение браузера, кэширование и другие аспекты.
  </p>
  <p>
    Метатеги полезны для оптимизации поисковой системы, управления кэшированием
    страницы и предоставления дополнительной информации о странице.
  </p>
</template>

<script>
export default {};
</script>
