<template>
  <h2>Как показывать разные изображения в зависимости от ширины браузера</h2>
  <p>
    Для показа разных изображений в зависимости от ширины браузера можно
    использовать медиа-запросы CSS. Это позволяет задать разные стили и
    изображения для разных размеров экрана или устройств.
  </p>
  <p>
    Например, вы можете использовать @media правила и указать разные
    background-image или srcset значения для разных размеров экрана.
  </p>
</template>

<script>
export default {};
</script>
