<template>
  <h2>Что будет если написать код в котором не закрыт тег</h2>
  <p>
    Если тег не закрыт в HTML-коде, браузер будет интерпретировать его как
    незакрытый тег и продолжит отображать содержимое до того момента, пока не
    встретит закрывающий тег или конец документа. Это может привести к
    непредсказуемому отображению страницы и нарушению структуры. Чтобы избежать
    таких проблем, важно всегда правильно закрывать теги в HTML-коде.
  </p>
</template>

<script>
export default {};
</script>
