<template>
  <h2>Какие основные теги и атрибуты используется в работе</h2>
  <p>{{ '<p>' }} В HTML есть множество тегов и атрибутов для создания различных элементов
и задания их свойств.</p>
<p> Некоторые распространенные теги включают {{ '<p>' }} для
параграфов, {{'<img>'}} для изображений, {{ '<a>' }} для ссылок, {{ '<div>' }} для
блоков и т.д. </p>
<p>Атрибуты, такие как class, id, src, href и style,
используются для добавления дополнительной информации и задания стилей
или ссылок на ресурсы.</p>


</template>

<script>
export default {};
</script>
