<template>
<h2>Что такое блочные и строчные элементы и в чем их разница</h2>
<p>Блочные элементы - это элементы, которые занимают всю доступную ширину
горизонтально и начинаются с новой строки. Примерами блочных элементов
являются {{ `<div>, <p>, <h1>-<h6>` }} . Строчные элементы, напротив,
занимают только необходимую ширину и не вызывают переноса строки.
Примерами строчных элементов являются {{ `<span>, <a>, <img>` }}. Основная
разница между ними заключается в том, как они ведут себя в потоке
содержимого и каким образом они взаимодействуют с другими элементами.</p>

</template>

<script>
export default {};
</script>
