<template>
<h2>Что делает noscript тэг</h2>
<p>Тег {{ `<noscript>` }} используется в HTML для предоставления альтернативного
содержимого, которое будет отображаться, если браузер пользователя не
поддерживает скрипты или если скрипты отключены. </p>
<p>Внутри тега
{{ `<noscript>` }}  вы можете разместить HTML-код, который будет отображаться в
случае, если скрипты не работают. Это может быть полезно для
предоставления альтернативных вариантов или инструкций пользователям,
которые не могут использовать скрипты.</p>

</template>

<script>
export default {};
</script>
