<template>
  <h2>В чем разница между == и ===</h2>
  <p>
    В JavaScript операторы сравнения == (двойное равенство) и === (тройное
    равенство) используются для сравнения значений. Они имеют следующие
    различия:
  </p>
  <p>== (двойное равенство):</p>
  <ul>
    <li>
      <p>
        Оператор == выполняет нестрогое сравнение, сравнивая значения с
        приведением типов, если это необходимо.
      </p>
    </li>
    <li>
      <p>
        Если типы операндов различаются, JavaScript пытается привести их к
        одному типу перед сравнением.
      </p>
    </li>
    <li>
      <p>
        Например, при сравнении числа и строки, строка будет преобразована в
        число перед сравнением.
      </p>
    </li>
  </ul>
  <p>=== (тройное равенство):</p>
  <ul>
    <li>
      <p>
        Оператор === выполняет строгое сравнение, сравнивая значения без
        приведения типов.
      </p>
    </li>
    <li>
      <p>
        Он сравнивает значения и типы операндов, и возвращает true только если
        они идентичны.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
