<template>
  <h2>Что такое Promise, и какие бывают состояния</h2>
  <p>
    Promise - это объект в JavaScript, который представляет результат
    асинхронной операции. Промис позволяет обрабатывать результат операции,
    когда он станет доступным, вместо того, чтобы блокировать выполнение кода и
    ожидать завершения операции.
  </p>
  <p>Промис может находиться в одном из трех состояний:</p>
  <ul>
    <li>
      <p>
        <strong>Pending</strong>: Исходное состояние промиса. Он находится в
        ожидании выполнения или отклонения операции.
      </p>
    </li>
    <li>
      <p>
        <strong>Fulfilled</strong>: Промис переходит в это состояние, когда
        операция успешно завершается. В этом случае промис возвращает результат
        операции.
      </p>
    </li>
    <li>
      <p>
        <strong>Rejected</strong>: Промис переходит в это состояние, когда
        операция завершается с ошибкой. В этом случае промис возвращает причину
        ошибки.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
