<template>
  <h2>Почему результатом сравнения двух похожих объектов является false</h2>
  <p>
    Результатом сравнения двух похожих объектов в JavaScript может быть false,
    потому что сравнение объектов происходит по ссылке, а не по содержимому.
  </p>
  <p>
    Когда мы сравниваем два объекта, JavaScript проверяет, указывают ли оба
    операнда на один и тот же объект в памяти. Если это так, то результатом
    будет true. Однако, если операнды указывают на разные объекты, даже если они
    имеют одинаковую структуру и значения свойств, результатом будет false.
  </p>
  <p>Пример:</p>
  <CodeWrapper lang="javascript">
    <pre>
        const obj1 = { name: 'John', age: 25 };
        const obj2 = { name: 'John', age: 25 };
        console.log(obj1 === obj2); // Вывод: false
    </pre>
  </CodeWrapper>

  <p>
    В этом примере obj1 и obj2 содержат одинаковые свойства и значения, но они
    являются разными объектами в памяти. Поэтому результатом сравнения obj1 ===
    obj2 будет false.
  </p>
  <p>
    Если вам нужно сравнить содержимое двух объектов, вам придется реализовать
    собственную логику сравнения, перебирая свойства объектов и сравнивая их
    значения.
  </p>
</template>

<script>
export default {};
</script>
