<template>
  <h2>В чем разница между методами call, apply, bind</h2>
  <p>
    Методы call, apply и bind являются частью языка JavaScript и используются
    для управления контекстом выполнения функций. Вот их основные различия:
  </p>
  <ul>
    <li>
      <p>
        call: Этот метод вызывает функцию с указанным контекстом и аргументами,
        переданными в виде отдельных аргументов. Синтаксис метода call выглядит
        следующим образом: function.call(context, arg1, arg2, .…). При
        использовании call аргументы передаются в виде списка, разделенного
        запятыми.
      </p>
    </li>
    <li>
      <p>
        apply: Этот метод вызывает функцию с указанным контекстом и аргументами,
        переданными в виде массива. Синтаксис метода apply выглядит следующим
        образом: function.apply(context, [arg1, arg2, .…]). При
        использовании apply аргументы передаются в виде массива.
      </p>
    </li>
    <li>
      <p>
        bind: Этот метод создает новую функцию, привязанную к указанному
        контексту. Он не вызывает функцию немедленно, а возвращает новую
        функцию, которую можно вызвать позже. Синтаксис метода bind выглядит
        следующим образом: function.bind(context). При
        использовании bind контекст функции фиксируется, и при вызове новой
        функции этот контекст будет сохраняться.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
