<template>
  <h2>Что такое функции высшего порядка</h2>
  <p>
    Функции высшего порядка - это функции, которые могут принимать другие
    функции в качестве аргументов или возвращать функции в качестве результата.
    В JavaScript функции высшего порядка являются мощным инструментом,
    позволяющим создавать более гибкий и модульный код. Вот несколько примеров
    функций высшего порядка:
  </p>
  <ul>
    <li>
      <p>
        <em>Функция обратного вызова (Callback)</em>: Функция, которая
        передается в качестве аргумента в другую функцию и вызывается внутри
        нее. Это позволяет передавать логику выполнения внутрь другой функции.
      </p>
    </li>
    <li>
      <p>
        <em>Функция обертка (Wrapper):</em> Функция, которая принимает другую
        функцию и возвращает новую функцию, добавляя дополнительную логику или
        изменяя поведение оригинальной функции.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
