<template>
  <h2>Как создать объект, не имеющий прототипа</h2>
  <p>
    В JavaScript объекты обычно наследуют свойства и методы от своих прототипов.
    Однако, существует несколько способов создания объекта без прототипа:
  </p>
  <ul>
    <li>
      <p>
        Использование Object.create(null): Метод Object.create(null) создает
        новый объект с указанным прототипом null, что означает, что объект не
        будет наследовать свойства и методы от какого-либо прототипа.
      </p>
    </li>
    <li>
      <p>
        Использование литерала объекта и null в качестве прототипа: Можно
        создать объект, используя литерал объекта и установив его прототип
        в null.
      </p>
    </li>
  </ul>
  <p>
    Использование функции-конструктора без прототипа: Можно создать
    функцию-конструктор, которая не имеет прототипа, и создать объект с помощью
    этой функции.
  </p>
  <p>
    Обратите внимание, что объекты без прототипа могут быть полезны в
    определенных случаях, но они также могут ограничивать функциональность и
    использование стандартных методов и свойств. Поэтому рекомендуется
    использовать объекты без прототипа с осторожностью и только в случаях, когда
    это действительно необходимо.
  </p>
</template>

<script>
export default {};
</script>
