<template>
  <h2>Что такое async/await</h2>
  <p>
    async/await - это синтаксический сахар в языке программирования, который
    позволяет писать асинхронный код в более понятном и линейном стиле. Он
    используется в языках, поддерживающих асинхронное программирование, таких
    как JavaScript, C#, Python и других.
  </p>
  <p>
    Преимущества использования async/await включают более простой и понятный
    синтаксис, отсутствие необходимости в явном использовании колбэков или
    цепочек промисов, а также возможность использования блоков try/catch для
    обработки ошибок.
  </p>
</template>

<script>
export default {};
</script>
