<template>
  <h2>В чем разница между spread-оператором и rest-оператором</h2>
  <p>
    Spread-оператор и rest-оператор - это два разных оператора, которые
    используются в JavaScript для работы с массивами и объектами.
  </p>
  <p><strong>Spread-оператор</strong> (…):</p>
  <ul>
    <li>
      <p>Распространяет элементы массива или свойства объекта.</p>
    </li>
    <li>
      <p>
        Используется для создания нового массива или объекта, содержащего
        элементы или свойства исходного массива или объекта.
      </p>
    </li>
    <li>
      <p>
        Распаковывает элементы массива или свойства объекта, позволяя передавать
        их в другие функции или объединять с другими массивами или объектами.
      </p>
    </li>
  </ul>
  <p><strong>Rest-оператор</strong> (…):</p>
  <ul>
    <li>
      <p>Собирает оставшиеся аргументы функции в массив.</p>
    </li>
    <li>
      <p>
        Используется для объявления параметра функции, который будет содержать
        все оставшиеся аргументы, переданные при вызове функции.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
