<template>
  <h2>Как определить наличие свойства в объекте</h2>
  <p>
    В JavaScript есть несколько способов определить наличие свойства в объекте.
  </p>
  <p>
    Оператор in: Можно использовать оператор in, чтобы проверить наличие
    свойства в объекте или его прототипе.
  </p>
  <p>
    Метод hasOwnProperty(): Метод hasOwnProperty() проверяет, содержит ли объект
    указанное свойство и не учитывает свойства в прототипе объекта.
  </p>
  <p>
    Сравнение со значением undefined: Можно сравнить значение свойства
    с undefined, чтобы определить его наличие.
  </p>
  <p>
    Использование Object.keys(): Можно использовать метод Object.keys() для
    получения массива всех свойств объекта и затем проверить наличие свойства в
    этом массиве.
  </p>
</template>

<script>
export default {};
</script>
