<template>
  <h2>Чем отличается Map от WeakMap</h2>
  <p>
    Map и WeakMap - это две разные структуры данных в JavaScript, которые
    предоставляют ассоциативное отображение ключей на значения.
  </p>
  <p>Вот основные отличия между Map и WeakMap:</p>
  <ul>
    <li>
      <p>
        <strong>Сильные ссылки и сборка мусора</strong>: В Map используются
        сильные ссылки на ключи, что означает, что если объект, используемый в
        качестве ключа, больше не используется, он не будет удален из памяти,
        пока есть ссылка на него. В WeakMap используются слабые ссылки на ключи,
        что означает, что если объект, используемый в качестве ключа, больше не
        имеет других ссылок, кроме ссылки из WeakMap, он может быть удален
        сборщиком мусора.
      </p>
    </li>
    <li>
      <p>
        <strong>Ключи</strong>: В Map ключами могут быть любые значения, включая
        примитивы и объекты. В WeakMap ключами могут быть только объекты.
      </p>
    </li>
    <li>
      <p>
        <strong>Итерация</strong>: Map поддерживает итерацию с помощью
        методов keys(), values() и entries(), которые возвращают итераторы для
        перебора ключей, значений и пар ключ-значение соответственно. WeakMap не
        поддерживает эти методы, поскольку слабые ссылки могут быть
        непредсказуемыми и не гарантируют порядок итерации.
      </p>
    </li>
    <li>
      <p>
        <strong>Размер</strong>: Map имеет свойство size, которое возвращает
        количество элементов в Map. WeakMap не имеет свойства size, поскольку
        слабые ссылки не позволяют точно определить количество элементов.
      </p>
    </li>
    <li>
      <p>
        <strong>Методы</strong>: Map предоставляет различные методы для работы с
        элементами, такие как set(), get(), has(), delete() и другие. WeakMap
        предоставляет только методы get(), set(), has() и delete().
      </p>
    </li>
    <li>
      <p>
        В целом, Map обычно используется для обычных случаев ассоциативного
        отображения, когда ключи и значения должны оставаться в памяти, пока
        есть ссылки на них. WeakMap полезен, когда вам нужно ассоциативное
        отображение с объектами в качестве ключей, и вы хотите, чтобы объекты
        могли быть автоматически удалены из WeakMap, когда больше нет ссылок на
        них.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
