<template>
  <h2>Как работает сборщик мусора в JS</h2>
  <p>
    Сборщик мусора в JavaScript является встроенной функцией, которая
    автоматически освобождает память, занятую объектами, которые больше не
    используются в программе. Он следит за объектами, которые были созданы во
    время выполнения программы, и определяет, когда они больше не доступны для
    использования.
  </p>
  <p>
    Сборщик мусора в JS использует алгоритм под названием "Mark and Sweep"
    (Пометка и Очистка). Вот как это работает:
  </p>
  <ul>
    <li>
      <p>
        Пометка (Mark): Сборщик мусора начинает с корневых объектов, таких как
        глобальный объект (window в браузере) и все объекты, на которые есть
        ссылки из корневых объектов. Он помечает эти объекты как активные.
      </p>
    </li>
    <li>
      <p>
        Распространение (Propagation): Сборщик мусора рекурсивно проходит через
        все активные объекты и помечает объекты, на которые они ссылаются, как
        активные. Этот процесс продолжается до тех пор, пока все достижимые
        объекты не будут помечены.
      </p>
    </li>
    <li>
      <p>
        Очистка (Sweep): После завершения пометки и распространения, сборщик
        мусора проходит по всей памяти и освобождает память, занятую не
        помеченными объектами. Он удаляет эти объекты и восстанавливает память
        для будущего использования.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
