<template>
  <h2>Что такое DOM</h2>
  <p>
    DOM (Document Object Model) - это программное представление веб-страницы или
    XML-документа в виде древовидной структуры. DOM представляет каждый элемент
    документа (такие как теги, текстовые блоки, атрибуты) в виде объектов,
    которые можно манипулировать с помощью языков программирования, таких как
    JavaScript.
  </p>
  <p>
    В JS DOM представлен объектом Document. DOM предоставляет стандартизированый
    способ доступа и изменения содержимого, структуры и стилей веб-страницы. Он
    позволяет программистам создавать динамические и интерактивные
    веб-приложения, изменять содержимое страницы, добавлять или удалять
    элементы, изменять атрибуты и стили, а также реагировать на события, такие
    как щелчки мыши или нажатия клавиш.
  </p>
</template>

<script>
export default {};
</script>
