<template>
  <h2>Какие типы данных есть в в JavaScript</h2>
  <p>Всего в JS 8 типов данных:</p>
  <ul>
    <li>
      <p>Число (number)</p>
    </li>
    <li>
      <p>Строка (string)</p>
    </li>
    <li>
      <p>Булевый (логический) тип (boolean)</p>
    </li>
    <li>
      <p>BigInt</p>
    </li>
    <li>
      <p>Symbol</p>
    </li>
    <li>
      <p>null</p>
    </li>
    <li>
      <p>undefiend</p>
    </li>
    <li>
      <p>Object</p>
    </li>
  </ul>
  <p>
    Ссылочные типы данных - это типы данных, которые хранятся и передаются по
    ссылке. Когда переменная присваивается ссылочному типу данных, она содержит
    ссылку на место в памяти, где хранятся фактические данные.
  </p>
  <p>
    Разница между ссылочными типами и примитивными типами заключается в том, что
    примитивные типы данных хранятся и передаются по значению, тогда как
    ссылочные типы данных хранятся и передаются по ссылке.
  </p>
  <p>
    JavaScript имеет гибкую типизацию, что означает, что переменные могут
    содержать значения разных типов и их тип может меняться во время выполнения
    программы.
  </p>
</template>

<script>
export default {};
</script>
