<template>
  <h2>Операторы в JavaScript</h2>
  <p>
    Оператор typeof возвращает тип операнда. Например, typeof 42 вернет
    "number", а typeof "hello" вернет "string".
  </p>
  <p>В JavaScript есть арифметические операторы:</p>
  <ul>
    <li>+ (сложение)</li>
    <li>- (вычитание)</li>
    <li>* (умножение)</li>
    <li>/ (деление)</li>
    <li>% (остаток от деления)</li>
  </ul>
  <p>
    Инкремент и декремент в JavaScript выполняются с помощью операторов ++
    (инкремент) и -- (декремент).
  </p>
  <p>
    Кроме стандартного оператора присваивания =, в JavaScript есть также
    операторы присваивания с комбинированными арифметическими операторами, такие
    как +=, -= и другие.
  </p>

  <p>В JavaScript есть операторы сравнения:</p>
  <ul>
    <li>== (равно)</li>
    <li>!= (не равно)</li>
    <li>=== (строго равно)</li>
    <li>!== (строго не равно)</li>
    <li>> (больше)</li>
    <li>{{ `<` }} (меньше)</li>
    <li>>= (больше или равно)</li>
    <li>{{ `<=` }} (меньше или равно)</li>
  </ul>
  <p>
    Разница между == и === заключается в том, что == выполняет нестрогое
    сравнение, преобразуя операнды при необходимости, а === выполняет строгое
    сравнение без преобразования типов. Рекомендуется использовать === для
    предотвращения неожиданного преобразования типов.
  </p>
  <p>Логические операторы в JavaScript:</p>
  <ul>
    <li>&& (логическое И)</li>
    <li>|| (логическое ИЛИ)</li>
    <li>! (логическое НЕ)</li>
  </ul>
  <p>Побитовые операторы в JavaScript:</p>
  <ul>
    <li>& (побитовое И)</li>
    <li>| (побитовое ИЛИ)</li>
    <li>^ (побитовое исключающее ИЛИ)</li>
    <li>~ (побитовое НЕ)</li>
    <li>{{ `<<` }} (побитовый сдвиг влево)</li>
    <li>>> (побитовый сдвиг вправо)</li>
    <li>>> (беззнаковый побитовый сдвиг вправо)</li>
  </ul>
</template>

<script>
export default {};
</script>
