<template>
  <h2>Как работает механизм всплытия событий в JavaScript</h2>
  <p>
    Всплытие событий — это механизм в JavaScript, при котором обработчики
    событий вызываются на родительских элементах вверх по иерархии DOM, начиная
    с целевого элемента события. Когда происходит событие, оно сначала
    обрабатывается на самом вложенном элементе, затем на его родителе, и так
    далее. Это позволяет реализовать делегирование событий и обработку событий
    на более высоком уровне иерархии элементов.
  </p>
</template>

<script>
export default {};
</script>
