<template>
  <h2>Что такое React</h2>
  <ul>
    <li>
      <p>
        React - это интерфейсная библиотека JavaScript, разработанная Facebook в
        2011 году.
      </p>
    </li>
    <li>
      <p>
        В нем используется компонентный подход, который помогает в создании
        повторно используемых компонентов пользовательского интерфейса.
      </p>
    </li>
    <li>
      <p>
        Используется для разработки сложных интерактивных веб- и мобильных
        интерфейсов.
      </p>
    </li>
    <li>
      <p>
        Несмотря на то, что он был доступен с открытым исходным кодом только в
        2015 году, его поддерживает одно из крупнейших сообществ.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
