<template>
  <h2>Как отследить размонтирование функционального компонента</h2>
  <p>
    Очень часто <strong>useEffect</strong> создает ресурсы, которые необходимо
    очистить или сбросить до того, как компонент покинет экран, например
    подписку или идентификатор таймера.
  </p>
  <p>
    Для этого функция, передаваемая в useEffect, может возвращать функцию
    очистки. Функция очистки запускается перед удалением компонента из
    пользовательского интерфейса для предотвращения утечек памяти. Кроме того,
    если компонент отображается несколько раз (как это обычно бывает), то перед
    выполнением следующего эффекта предыдущий эффект очищается.
  </p>
</template>

<script>
export default {};
</script>
