<template>
  <h2>
    В каких случаях можно использовать локальное состояние, а когда следует
    использовать глобальное состояние
  </h2>
  <p>Локальное состояние следует применять в тех случаях, когда оно:</p>
  <ul>
    <li>
      <p>Используется только в рамках одного компонента и не передается другим компонентам.</p>
    </li>
    <li>
      <p>Используется в компоненте, который представляет собой отдельный элемент списка.</p>
    </li>
  </ul>
  <p>
    Однако если декомпозиция компонента затрагивает вложенные компоненты,
    передающие данные по иерархии, лучше использовать глобальное состояние.
  </p>
</template>

<script>
export default {};
</script>
