<template>
  <h2>В чем заключаются особенности работы с Mobx</h2>
  <p>
    <strong>Mobx</strong> предоставляет декораторы observable и computed для
    определения наблюдаемого состояния и реактивных функций. Для изменения
    состояния используются действия, декорированные с помощью action, что
    обеспечивает отслеживание всех изменений.
  </p>
  <p>
    Mobx также предлагает автоматическое отслеживание зависимостей, различные
    типы реакций, тонкий контроль над реактивностью и простую интеграцию с React
    с помощью пакета <strong>mobx-react</strong>.
  </p>
  <p>
    В целом Mobx упрощает управление состоянием, автоматизируя процесс
    обновления на основе изменений в наблюдаемом состоянии.
  </p>
</template>

<script>
export default {};
</script>
