<template>
  <h2>Как получить доступ к переменной в состоянии Mobx</h2>
  <p>
    Получить доступ к переменной в состоянии можно с помощью
    декоратора observable для определения переменной как наблюдаемой. Вот
    пример:
  </p>
  <p>
    В данном примере переменная myVariable определяется как наблюдаемая с
    помощью декоратора observable. Затем к переменной можно получить доступ с
    помощьюstore.myVariable. Любые изменения, внесенные в myVariable, будут
    автоматически вызывать обновления в зависимых компонентах или реакциях.
  </p>
  <p>
    Подробнее о доступе к переменным <a href="https://mobx.js.org/actions.html"
      >написано здесь</a
    >.
  </p>
</template>

<script>
export default {};
</script>
