<template>
  <h2>Что такое пробрасывание пропсов (props drilling)</h2>
  <p>
    Под пробрасыванием («сверлением») реквизитов понимается процесс передачи
    реквизитов через несколько уровней вложенных компонентов, даже если
    некоторые промежуточные компоненты не используют эти пропсы напрямую.
    Глубокое пробрасывание делает структуру кода сложной и запутанной.
  </p>
  <p>
    В этом примере реквизит data передается от родительского компонента
    к ChildA, а затем от ChildAк ChildB, хотя ChildA напрямую не использует этот
    реквизит. Этот подход приведет к серьезным проблемам при наличии большого
    количества уровней вложенности или при необходимости доступа к данным со
    стороны компонентов, расположенных дальше по дереву: код станет очень
    сложным для понимания и поддержки.
  </p>
  <p>
    Устранить проблему пробрасывания можно с помощью контекста или библиотек
    управления состоянием, таких как Redux или MobX. Эти подходы позволяют
    получить доступ к данным через компоненты без необходимости передавать
    реквизиты через каждый промежуточный компонент. Так, например, можно решить
    проблему с помощью контекста:
  </p>
</template>

<script>
export default {};
</script>
