<template>
  <h2>Для чего используется useCallback и как он работает</h2>
  <p>
    Хук useCallback возвращает мемоизированную версию коллбэк-функции. Эта
    версия будет изменяться только в том случае, если изменятся значения
    зависимостей в массиве зависимостей, переданном
    в <strong>useCallback</strong>.
  </p>
  <ul>
    <li>
      <p>Хук используют для передачи функций обратного вызова в</p>

      <p>
        оптимизированные дочерние компоненты, которые для предотвращения лишних
        отрисовок полагаются на ссылочное равенство (===).
      </p>
    </li>
    <li>
      <p>Благодаря тому, что useCallback возвращает мемоизированную версию,</p>

      <p>
        ссылка на коллбэк будет стабильной между рендерами, если зависимости не
        изменились.
      </p>
    </li>
  </ul>
  <p>
    Таким образом, useCallback позволяет оптимизировать производительность
    за счет избежания лишних отрисовок.
  </p>
</template>

<script>
export default {};
</script>
