<template>
  <h2>Как используют React Context</h2>
  <p>
    <strong>React Context</strong> обеспечивает передачу данных по дереву
    компонентов без пробрасывания реквизитов через каждый промежуточный уровень
    (см. ответ на вопрос <strong>21</strong>). Context позволяет создать
    глобальное состояние, доступ к которому может получить любой компонент в
    дереве, независимо от его положения. Контекст полезен, когда необходимо
    обмениваться данными между несколькими компонентами, не связанными напрямую.
  </p>
  <p><strong>React Context API</strong> состоит из трех основных частей:</p>
  <ul>
    <li>
      <p>
        <strong>createContext</strong> – используется для создания нового
        объекта
      </p>

      <p>контекста.</p>
    </li>
    <li>
      <p>
        <strong>Context.Provider</strong> – используется для предоставления
        значения
      </p>

      <p>
        контексту. Он оборачивает компоненты, которым необходим доступ к
        значению.
      </p>
    </li>
    <li>
      <p>
        <strong>Context.Consumer</strong> или хук <strong>useContext</strong> –
        этот компонент или
      </p>

      <p>
        хук используется для получения значения из контекста. Он может быть
        использован в любом компоненте, входящем в состав провайдера контекста.
      </p>
    </li>
  </ul>
  <p>
    Использование React Context позволяет избежать передачи реквизитов через
    несколько уровней компонентов (<strong>prop drilling</strong>) и легко
    управлять состоянием на более высоком уровне – это улучшает читаемость кода
    и производительность приложения.
  </p>
  <p>
    Подробнее об использовании контекста для передачи данных написано
    в документации.
  </p>
</template>

<script>
export default {};
</script>
