<template>
  <h2>Для чего используется useContext и как он работает</h2>
  <p>
    В типичном React-приложении данные передаются сверху вниз (от родительского
    компонента к дочернему) с помощью реквизитов (пропсов). Однако такой способ
    может оказаться слишком громоздким для некоторых типов реквизитов, которые
    нужно передавать многим компонентам – из-за языка или темы пользовательского
    интерфейса, например. Контекст предоставляет возможность обмена данными
    между компонентами без необходимости явной передачи реквизита через каждый
    уровень дерева.
  </p>
  <p>
    Компонент, вызывающий <strong>useContext</strong>, всегда будет
    перерисовываться при изменении значения контекста. Если перерисовка
    компонента требует больших затрат, можно оптимизировать ее с помощью
    мемоизации.
  </p>
</template>

<script>
export default {};
</script>
