<template>
  <h2>Для чего используется useRef и как он работает</h2>
  <p>
    Хук <strong>useRef</strong> возвращает ссылку (ref-объект), которая может
    быть привязана к текущему значению какого-либо элемента или состояния
    компонента. При создании этого объекта, начальное значение устанавливается
    равным переданному аргументу. Такой объект сохраняется между различными
    рендерами компонента и его значение не меняется: если мы изменим значение
    переданного аргумента, это не повлияет на ref-объект.
  </p>
  <p>
    Обычно useRef используется для доступа к дочерним элементам в императивном
    стиле, то есть явно обращаясь к какому-то элементу DOM. Это позволяет
    выполнять различные действия над элементом – изменять стили, добавлять
    события и т.д.
  </p>
</template>

<script>
export default {};
</script>
