<template>
  <h2>Что такое виртуальный DOM</h2>
  <p>
    Виртуальный DOM в React – концепция создания и хранения в памяти
    облегченного виртуального представления реальной DOM (объектной модели
    документа). Этот подход помогает оптимизировать производительность
    веб-приложений:
  </p>
  <ul>
    <li>
      <p>
        Если данные или состояние React-компонента изменяются, вместо прямых
      </p>
      <blockquote>
        <p>манипуляций с реальной DOM-моделью обновляется виртуальная.</p>
      </blockquote>
    </li>
    <li>
      <p>Затем в виртуальной модели DOM вычисляется разница между предыдущим</p>
      <blockquote>
        <p>
          и обновленным состоянием компонента (с
          помощью <strong>diffing</strong>-алгоритма).
        </p>
      </blockquote>
    </li>
    <li>
      <p>После выявления различий React эффективно обновляет только</p>
      <blockquote>
        <p>необходимые части реальной DOM для отражения изменений.</p>
      </blockquote>
    </li>
  </ul>
  <p>
    Использование виртуальной DOM позволяет React создавать динамичные и
    интерактивные пользовательские интерфейсы, обеспечивая при этом оптимальную
    эффективность и скорость рендеринга.
  </p>
</template>

<script>
export default {};
</script>
