<template>
  <h2>Что такое React.memo()</h2>
  <p>
    <strong>React.memo()</strong> – это компонент высшего порядка, который
    используется для оптимизации производительности веб-приложений. Если
    компонент, который вы хотите оптимизировать, всегда отображает один и тот же
    результат с неизменными реквизитами (props), вы можете обернуть его вызов в
    React.memo, чтобы запомнить его результат. Таким образом, React может
    использовать последний отрендеренный результат этого компонента вместо того,
    чтобы снова его рендерить, если входные данные не изменились. Это помогает
    оптимизировать производительность, так как повторный рендеринг может быть
    затратным по ресурсам. Важно отметить, что React.memo влияет только на
    изменение входных данных (реквизитов): если функциональный компонент,
    обернутый в React.memo,
    использует <strong>useState</strong>, <strong>useReducer</strong> или useContext для
    изменения своего состояния или контекста, он все равно будет перерисован при
    изменении этих состояний или контекстов.
  </p>
</template>

<script>
export default {};
</script>
