<template>
  <h2>Что такое фрагмент React</h2>
  <p>
    Возврат нескольких элементов из компонента – обычная практика в React.
    Однако это может привести к созданию большого количества элементов в дереве
    виртуального DOM, отчего пострадает производительность приложения.
  </p>
  <p>
    <strong>Фрагменты React</strong> позволяют группировать несколько элементов
    внутри функции-компонента, избегая таким образом создания большого
    количества узлов в виртуальном DOM. Это улучшает производительность
    приложения и читаемость кода.
  </p>
</template>

<script>
export default {};
</script>
