<template>
  <h2>Как получить доступ к элементу DOM</h2>
  <p>
    Чтобы получить доступ к DOM-элементу в React, нужно создать ссылку на этот
    элемент. Это можно сделать с помощью функции React.createRef() или
    хука <strong>useRef()</strong>. После создания ссылки ее нужно присоединить
    к компоненту React, для которого нужно получить доступ к DOM, с помощью
    атрибута ref. Затем, чтобы получить доступ к самому элементу DOM, можно
    обратиться к созданной ссылке через <strong>ref.current</strong>:
  </p>
</template>

<script>
export default {};
</script>
