<template>
  <h2>Как выполнить рендеринг элементов массива</h2>
  <p>
    Для рендеринга статического списка можно использовать
    метод <strong>map()</strong>, который перебирает элементы и возвращает новый
    массив элементов React:
  </p>
  <p>
    Для рендеринга элементов <strong>динамического</strong> списка
    используют <strong>ключи</strong>. Они необходимы для оптимизации процесса
    рендеринга, позволяя React быстро определить, какие элементы были изменены,
    удалены или добавлены:
  </p>
</template>

<script>
export default {};
</script>
