<template>
  <h2>Перечислите преимущества серверного рендеринга.</h2>
  <p>Серверный рендеринг имеет несколько весомых преимуществ:</p>
  <ul>
    <li>
      <p>
        <strong>Улучшение времени загрузки</strong> – серверный‌ рендеринг
        позволяет
      </p>

      <p>
        серверу отправить пользователю полностью готовую к отображению
        HTML-страничку, уменьшая тем самым объем обработки на стороне клиента и
        ускоряя загрузку страницы.
      </p>
    </li>
    <li>
      <p>
        <strong>Улучшение видимости в поисковых системах</strong> – поисковые
        роботы
      </p>

      <p>
        могут легко просматривать и индексировать содержание страниц,
        обработанных на стороне сервера, что приводит к улучшению видимости в
        результатах поиска.
      </p>
    </li>
    <li>
      <p>
        <strong>Обеспечение доступности</strong> – серверный рендеринг
        обеспечивает
      </p>

      <p>
        доступность контента для пользователей с отключенным JavaScript,
        гарантируя надежное и полное отображение всех страниц приложения.
      </p>
    </li>
    <li>
      <p>Повышение производительности в условиях низкой‌ скорости</p>

      <p>
        интернета –серверный рендеринг уменьшает объем данных, получаемых
        пользователем.
      </p>
    </li>
  </ul>
  <p>
    Несмотря на все преимущества SSR, важно отметить, что по сравнению с
    методами рендеринга на стороне клиента он может создавать большую нагрузку
    на сервер и усложнять обслуживание. Необходимо тщательно учитывать такие
    факторы, как кэширование, масштабируемость и оптимизация производительности
    рендеринга на стороне сервера.
  </p>
</template>

<script>
export default {};
</script>
