<template>
  <h2>Какие основные функции Next.js вы знаете</h2>
  <p>
    <strong>getStaticProps</strong> – метод используется для получения данных во
    время сборки и предварительного рендеринга страницы в виде статического
    HTML. Он гарантирует, что данные будут доступны во время сборки и не
    изменятся при последующих запросах.
  </p>
  <p>
    <strong>getServerSideProps</strong> – используется для получения данных при
    каждом запросе и предварительного рендеринга страницы на сервере.
    Пригодится, когда необходимо получить данные, которые могут часто меняться
    или являются специфическими для пользователя.
  </p>
  <p>
    <strong>getStaticPaths</strong> – используется для определения списка
    статичных путей, которые будут доступны во время компиляции приложения. Этот
    метод обычно используется для генерации данных для динамических страниц с
    параметрами. Например, если у вас есть динамическая страница с ID
    пользователя в качестве параметра, вы можете
    использовать getStaticPaths для определения всех возможных ID
    пользователей, которые могут быть использованы на этой странице. Это
    позволяет Next.js предварительно сгенерировать все возможные страницы, что
    улучшает производительность приложения.
  </p>
</template>

<script>
export default {};
</script>
