<template>
  <h2>Какие архитектурные решения для React вы знаете</h2>
  <p>
    Существует несколько архитектурных решений и паттернов для построения
    React-проектов. К числу популярных относятся:
  </p>
  <ul>
    <li>
      <p>
        <strong>MVC (Model-View-Controller).</strong> Это традиционный
        архитектурный
      </p>

      <p>
        паттерн, разделяющий приложение на три основных компонента – модель,
        представление и контроллер. React может использоваться в слое View для
        визуализации пользовательского интерфейса, в то время как для слоев
        Model и Controller могут применяться другие библиотеки или фреймворки.
      </p>
    </li>
    <li>
      <p>
        <strong>Flux.</strong> Эта архитектура была создана разработчиками
        Facebook*
      </p>

      <p>
        специально для приложений React. Он основан на однонаправленной передаче
        данных, что упрощает понимание кода и отладку компонентов приложения.
      </p>
    </li>
    <li>
      <p>
        <strong>Atomic Design.</strong> Это универсальная методология
        проектирования,
      </p>

      <p>
        которая разделяет пользовательский интерфейс на более мелкие
        самодостаточные компоненты многократного использования. Такие компоненты
        удобно комбинировать для создания более сложных пользовательских
        интерфейсов.
      </p>
    </li>
    <li>
      <p>
        <strong>Паттерн «Контейнер и компонент».</strong> Этот паттерн отделяет
      </p>

      <p>
        представление (компонент) от логики и управления состоянием (контейнер).
        Компоненты отвечают за визуализацию пользовательского интерфейса, а
        контейнеры – за бизнес-логику и управление состоянием.
      </p>
    </li>
    <li>
      <p>
        <strong>Feature-Sliced Design.</strong> Это современный архитектурный
        подход,
      </p>

      <p>
        используемый для организации и структурирования React-приложений. Он
        направлен на решение проблем масштабируемости, сопровождения и
        повторного использования путем разделения кодовой базы приложения на
        основные функциональные модули.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
