<template>
  <h2>Как выполняется валидация данных в React-приложении</h2>
  <p>Валидацию данных можно реализовать несколькими способами:</p>
  <ul>
    <li>
      <p>PropTypes -- это встроенный в React механизм, который позволяет</p>
      
        <p>
          определить тип данных для каждого реквизита компонента. Если тип
          данных не соответствует ожидаемому, PropTypes выводит предупреждение в
          консоль браузера.
        </p>
      
    </li>
    <li>
      <p>Пользовательские функции проверки -- разработчик может написать</p>
      
        <p>
          свои функции для проверки правильности данных. Такие функции можно
          вызывать внутри компонента и использовать их для отображения сообщений
          об ошибках или изменения состояния компонента при обнаружении
          некорректных данных.
        </p>
      
    </li>
    <li>
      <p>
        <strong>Сторонние библиотеки</strong> – существуют сторонние библиотеки
      </p>
      
        <p>
          (например <strong>yup</strong>, <strong>joi</strong>, <strong>zod</strong>),
          которые предоставляют более мощные и гибкие инструменты для проверки
          данных. Они также обычно предоставляют более удобные способы
          отображения ошибок.
        </p>
      
    </li>
  </ul>
</template>

<script>
export default {};
</script>
