<template>
  <h2>Чем управляемые компоненты отличаются от неуправляемых</h2>
  <p>
    Разница между управляемыми и неуправляемыми компонентами заключается в том,
    как они управляют своим состоянием и обновляют его.
  </p>
  <p>
    <strong>Управляемые компоненты</strong> – это компоненты, состояние которых
    контролируется React. Компонент получает свое текущее значение и обновляет
    его через реквизиты (пропсы). При изменении значения он также запускает
    функцию обратного вызова. Это означает, что компонент не хранит собственное
    внутреннее состояние – вместо этого родительский компонент управляет им и
    передает значение управляемому компоненту.
  </p>
  <p>
    <strong>Неуправляемые компоненты</strong>, напротив, управляют своим
    состоянием самостоятельно с помощью ссылок или других методов. Они хранят и
    обновляют свое состояние самостоятельно, не полагаясь на реквизиты или
    обратные вызовы. Родительский компонент имеет меньший контроль над
    состоянием неуправляемых компонентов.
  </p>
</template>

<script>
export default {};
</script>
