<template>
  <h2>Что такое методы жизненного цикла компонента</h2>
  <p>
    Методы жизненного цикла – это способ подключения к различным этапам
    жизненного цикла компонента, позволяющий выполнять определенный код в
    определенное время. Вот список основных методов:
  </p>
  <ul>
    <li>
      <p>
        <strong>constructor</strong> – первый метод, вызываемый при создании
        компонента.
      </p>
      
        <p>
          Он используется для инициализации состояния и привязки обработчиков
          событий. В функциональных компонентах для аналогичных целей
          используется хук <strong>useState</strong>.
        </p>
      
    </li>
    <li>
      <p>render -- отвечает за рендеринг JSX-разметки и возвращает</p>
      
        <p>содержимое, которое будет выведено на экран.</p>
      
    </li>
    <li>
      <p>
        <strong>componentDidMount</strong> – вызывается сразу после рендеринга
      </p>
      
        <p>
          компонента в DOM. Обычно используется для задач инициализации, таких
          как вызов API или настройка слушателей событий.
        </p>
      
    </li>
    <li>
      <p>
        <strong>componentDidUpdate</strong> – вызывается при изменении
        реквизитов или
      </p>
      
        <p>
          состояния компонента. Позволяет выполнять побочные эффекты, обновлять
          компонент на основе изменений или запускать дополнительные вызовы API.
        </p>
      
    </li>
    <li>
      <p>
        <strong>componentWillUnmount</strong> – вызывается непосредственно перед
      </p>
      
        <p>
          удалением компонента из DOM. Используется для очистки ресурсов,
          которые были установлены в componentDidMount, например, для удаления
          слушателей событий или отмены таймеров.
        </p>
      
    </li>
  </ul>
  <p>
    Некоторые методы жизненного цикла (componentWillMount,
    componentWillReceiveProps и componentWillUpdate) уже устарели, вместо них
    следует использовать альтернативные методы или хуки.
  </p>
</template>

<script>
export default {};
</script>
