<template>
  <h2>В чем заключаются особенности использования useState</h2>
  <p>useState возвращает значение состояния и функцию для его обновления.</p>
  <p>
    Во время первого рендеринга возвращаемое состояние соответствует значению,
    переданному в качестве первого аргумента. Для обновления состояния
    используется функция setState. Она принимает в качестве параметра новое
    значение состояния и ставит компонент в очередь на повторный рендеринг.
    Функция setState может также принимать в качестве параметра функцию
    обратного вызова, которая принимает в качестве параметра предыдущее значение
    состояния.
  </p>
</template>

<script>
export default {};
</script>
