<template>
  <h2>В чем заключаются особенности использования useEffect</h2>
  <p>
    Хук <strong>useEffect</strong> позволяет выполнять побочные эффекты в
    функциональном компоненте. Мутации, подписки, таймеры, логирование и другие
    побочные эффекты не должны выполняться во время первой фазы рендеринга: это
    может привести к ошибкам и несоответствиям в пользовательском интерфейсе.
  </p>
  <p>
    Вместо этого рекомендуется использовать <strong>useEffect</strong>. Функция,
    переданная в useEffect, будет выполняться после фазы фиксации, а если в
    качестве второго параметра передать массив зависимостей, то функция будет
    вызываться каждый раз, когда одна из зависимостей изменяется.
  </p>
</template>

<script>
export default {};
</script>
