<template>
<h2>Каким образом можно обрабатывать мультимедиа в браузере</h2>
<p>В браузере можно обрабатывать мультимедиа с помощью различных технологий
и API. </p>
<p>Например, для воспроизведения аудио и видео можно использовать
HTML5 <strong>{{`<audio> `}}</strong> и  <strong>{{ `<video> `}}</strong> элементы, а также JavaScript API для
управления воспроизведением. </p>
<p>Для работы с изображениями можно
использовать <strong>{{ `<img> ` }}</strong> элемент и JavaScript API для управления
изображениями.</p>

</template>

<script>
export default {};
</script>
