<template>
  <h2>Что такое "ленивая загрузка" (lazy loading) и как она работает</h2>
  <p>
    "Ленивая загрузка" (lazy loading) — это техника оптимизации загрузки
    контента, при которой ресурсы загружаются только тогда, когда они становятся
    видимыми во время прокрутки страницы или взаимодействия пользователя. Это
    позволяет улучшить производительность и уменьшить время загрузки страницы. В
    HTML и JavaScript есть различные способы реализации ленивой загрузки,
    включая использование атрибутов loading="lazy" для изображений и
    Intersection Observer API для отслеживания видимости элементов.
  </p>
</template>

<script>
export default {};
</script>
