<template>
  <h2>
    Что такое "серверный рендеринг" (server-side rendering) и "клиентский
    рендеринг" (client-side rendering)
  </h2>
  <p>
    "Серверный рендеринг" (server-side rendering) и "клиентский рендеринг"
    (client-side rendering) — это два подхода к генерации и отображению
    веб-страниц. Серверный рендеринг означает, что HTML-код страницы
    генерируется на сервере и отправляется в браузер, уже готовый к отображению.
    Клиентский рендеринг, напротив, означает, что основная часть работы по
    генерации и отображению страницы выполняется на стороне клиента (в браузере)
    с использованием JavaScript.
  </p>
</template>

<script>
export default {};
</script>
