<template>
  <h2>Что такое Web Workers и Service Workers</h2>
  <p>
    Web Workers – это отдельные потоки JavaScript, которые работают параллельно
    с основным потоком JavaScript и доступны только веб-приложению. Они
    используются для выполнения сложных задач, которые могут занимать
    значительное время для обработки, таких как обработка данных или генерация
    отчетов. Они обеспечивают параллельное выполнение кода, что ускоряет процесс
    выполнения.
  </p>
  <p>
    Web Workers могут использоваться только в современных браузерах. Их создание
    происходит путем вызова конструктора Worker(). В качестве аргумента этот
    конструктор должен принимать URL-адрес файла JavaScript, который будет
    выполняться в потоке worker.
  </p>

  <p>
    Service Workers – это скрипты, которые выполняются в фоновом режиме,
    независимо от веб-приложения.
  </p>
  <p>
    Они обрабатывают события сети, такие как запросы на получение ресурсов, и
    позволяют кешировать ресурсы и работать без подключения к Интернету.
    Сервисный рабочий процесс не имеет доступа к DOM-структурам веб-страницы.
    Вместо этого он использует объект ServiceWorkerGlobalScope для доступа к
    окружению выполнения.
  </p>
</template>

<script>
export default {};
</script>
