<template>
  <h2>Какие методы можно использовать для оптимизации загрузки ресурсов</h2>
  <ul>
    <li>
      <p>
        Минификация и сжатие файлов - уменьшение размера файлов JavaScript, CSS
        и изображений.
      </p>
    </li>
    <li>
      <p>
        Кеширование - сохранение ресурсов на стороне клиента для повторного
        использования.
      </p>
    </li>
    <li>
      <p>
        Асинхронная загрузка - загрузка ресурсов параллельно без блокирования
        основного контента страницы.
      </p>
    </li>
    <li>
      <p>
        Lazy loading - отложенная загрузка ресурсов, таких как изображения,
        только когда они становятся видимыми.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
