<template>
  <h2>Расскажите как работает браузер</h2>
  <p>
    Браузер - это программное обеспечение, которое позволяет пользователям
    просматривать и взаимодействовать с веб-страницами. Вот основные шаги,
    которые браузер выполняет для отображения веб-страницы:
  </p>
  <ul>
    <li>
      <p>
        <strong>Ввод URL</strong>: Пользователь вводит URL (Uniform Resource
        Locator) в адресную строку браузера. URL указывает на веб-страницы,
        которую пользователь хочет посетить.
      </p>
    </li>
    <li>
      <p>
        <strong>DNS-запрос</strong>: Браузер отправляет DNS-запрос (Domain Name
        System) на DNS-сервер, чтобы получить IP-адрес сервера, на котором
        хранится веб-страница. DNS-сервер преобразует доменное имя в соответствующий IP-адрес.
      </p>
    </li>
    <li>
      <p>
        <strong>Установка соединения</strong>: Браузер устанавливает
        TCP-соединение с сервером, используя полученный IP-адрес. Это позволяет
        браузеру отправлять и получать данные от сервера.
      </p>
    </li>
    <li>
      <p>
        <strong>Запрос страницы</strong>: Браузер отправляет HTTP-запрос
        (Hypertext Transfer Protocol) на сервер, запрашивая веб-страницу. Запрос
        может содержать различные параметры, такие как метод запроса (GET, POST
        и т. д.), заголовки и тело запроса.
      </p>
    </li>
    <li>
      <p>
        <strong>Получение ответа</strong>: Сервер обрабатывает запрос и
        отправляет обратно HTTP-ответ, содержащий запрошенную веб-страницу.
        Ответ может также содержать различные заголовки, статус ответа и тело
        ответа.
      </p>
    </li>
    <li>
      <p>
        <strong>Загрузка ресурсов</strong>: Браузер загружает все связанные
        ресурсы, такие как изображения, стили CSS, скрипты JavaScript и другие
        файлы, указанные в HTML-коде страницы.
      </p>
    </li>
    <li>
      <p>
        <strong>Рендеринг страницы</strong>: Браузер получает ответ от сервера и
        начинает обрабатывать его. Он анализирует HTML-код страницы, строит DOM
        (Document Object Model) - внутреннее представление страницы, и создает
        дерево элементов.
      </p>
    </li>
    
    <li>
      <p>
        <strong>Отображение страницы</strong>: Браузер использует полученные
        ресурсы и информацию о стилях для отображения страницы на экране. Он
        располагает элементы в соответствии с их CSS-свойствами, применяет
        шрифты, цвета и другие стили, и отображает содержимое страницы.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
