<template>
  <h2>Какие основные компоненты входят в браузер</h2>
  <p>Основные компоненты браузера включают:</p>
  <ul>
    <li>
      <p>
        Движок рендеринга (rendering engine), который отображает содержимое
        веб-страницы.
      </p>
    </li>
    <li>
      <p>
        Механизмы JavaScript, которые обрабатывают и выполняют код JavaScript.
      </p>
    </li>
    <li>
      <p>Кэш, который хранит временные копии ранее посещенных страниц.</p>
    </li>
    <li>
      <p>
        Управление сетевыми запросами для загрузки веб-страниц и других
        ресурсов.
      </p>
    </li>
    <li>
      <p>
        Интерфейс пользователя, который позволяет взаимодействовать с браузером.
      </p>
    </li>
  </ul>
</template>

<script>
export default {};
</script>
